export default function Terms() {
  return (
    <div className="flex flex-col items-center max-w-3/4 mr-auto ml-auto mb-5 mt-5">
      <h1 className="text-3xl font-bold">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ BerryShop</h1>
      <p> Последнее обновление: [28.08.2025] </p>
      <div>
        <h2 className="text-2xl font-bold">1. Введение</h2>
        <p>BerryShop уважает ваше право на конфиденциальность и обязуется защищать персональные данные, которые вы нам предоставляете. Данная Политика конфиденциальности объясняет, как мы собираем, используем и защищаем вашу информацию.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">2. Какие данные мы собираем</h2>
        <p>Мы можем собирать следующие типы данных:</p>
        <p>Данные, предоставляемые вами: Имя, фамилия, адрес электронной почты, номер телефона, почтовый адрес доставки, данные платежной карты (которые обрабатываются напрямую платежным шлюзом и не хранятся на наших серверах)..</p>
        <p>Данные, собираемые автоматически: При посещении Сайта мы автоматически можем собирать техническую информацию, такую как ваш IP-адрес, тип браузера, данные о вашем устройстве, страницы, которые вы посещаете, и время, проведенное на Сайте, с помощью файлов cookie и аналогичных технологий.</p>
      </div>

      <div>
        <h2 className="text-2xl font-bold">3. Как мы используем ваши данные</h2>
        <p>Мы используем ваши персональные данные для:</p>
        <p>Обработки и доставки ваших заказов.</p>
        <p>Связи с вами по поводу вашего заказа (подтверждение, статус доставки).</p>
        <p>Рассылки маркетинговых сообщений (только если вы дали на это согласие).</p>
        <p>Улучшения работы нашего Сайта и качества обслуживания.</p>
        <p>Предотвращения мошенничества и обеспечения безопасности.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">4. Файлы Cookie</h2>
        <p>Мы используем файлы cookie для работы корзины товаров, запоминания ваших предпочтений, анализа трафика и показа рекламы.</p>
        <p>Вы можете настроить свой браузер так, чтобы он отклонял все файлы cookie или оповещал об их отправке. Однако некоторые функции Сайта могут перестать работать корректно.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">5. Обмен данными с третьими лицами</h2>
        <p>Мы не продаем и не передаем ваши персональные данные третьим лицам, за исключением случаев, когда это необходимо для:</p>
        <p>Оказания услуг: Мы можем делиться данными с надежными партнерами, которые оказывают услуги от нашего имени (например, курьерские службы, платежные системы, службы электронной рассылки). Эти партнеры имеют доступ только к тем данным, которые необходимы для выполнения их функций. </p>
        <p>По требованию закона: Мы можем раскрывать информацию, если это требуется по закону или для защиты наших прав и безопасности.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">6. Безопасность данных</h2>
        <p>Мы применяем различные меры безопасности (включая административные, технические и физические) для защиты ваших персональных данных от несанкционированного доступа, изменения, раскрытия или уничтожения.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">7. Ваши права</h2>
        <p>Вы имеете право:</p>
        <p>Запрашивать доступ, исправление или удаление ваших персональных данных.</p>
        <p>Отозвать свое согласие на обработку данных (например, отписаться от рассылки).</p>
        <p>Ограничить или возразить против обработки ваших данных.</p>
        <p>Чтобы реализовать эти права, свяжитесь с нами по контактам, указанным ниже.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">8. Хранение данных</h2>
        <p>Мы храним ваши персональные данные только до тех пор, пока это необходимо для целей, описанных в настоящей Политике, или в соответствии с требованиями законодательства.</p>
      </div>

      <div>
        <h2 className="text-2xl font-bold">9. Изменения в Политике конфиденциальности</h2>
        <p>Мы можем время от времени обновлять данную Политику. Все изменения будут опубликованы на этой странице с указанием даты последнего обновления.</p>
      </div>

      <div>
        <h2 className="text-2xl font-bold">10. Контактная информация</h2>
        <p>По всем вопросам, связанным с Условиями использования, обращайтесь:</p>
        <p>BerryShop</p>
        <p>Электронная почта: Mironovari01@gmail.com</p>
        <p>+7 922 256-52-41</p>
        <p>+7 (982) 585-57-52</p>
      </div>
    </div>
  )
}