export default function Privacy() {
  return (
    <div className="flex flex-col items-center max-w-3/4 mr-auto ml-auto mb-5 mt-5">
      <h1 className="text-3xl font-bold">УСЛОВИЯ ИСПОЛЬЗОВАНИЯ BerryShop</h1>
      <p> Последнее обновление: [28.08.2025] </p>
      <div>
        <h2 className="text-2xl font-bold">1. Введение</h2>
        <p>Добро пожаловать в BerryShop. Данный веб-сайт (далее – «Сайт») принадлежит и управляется BerryShop.</p>
        <p>Пользуясь нашим Сайтом, вы соглашаетесь с настоящими Условиями использования. Если вы не согласны с этими условиями, пожалуйста, не используйте наш Сайт.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">2. Товары и цены</h2>
        <p>Мы стремимся максимально точно отображать на Сайте товары, их описания, изображения и цены.</p>
        <p>Все цены указаны в рублях и включают в себя все налоги (НДС), если не указано иное.</p>
        <p>Мы оставляем за собой право изменять цены на товары в любое время без предварительного уведомления.</p>
        <p>Несмотря на наши усилия, на Сайте может содержаться неточная информация (например, ошибка в цене или описании товара). Мы оставляем за собой право исправить любые ошибки и отменить заказы, размещенные на основании неверной информации.</p>
      </div>

      <div>
        <h2 className="text-2xl font-bold">3. Размещение заказа и оплата</h2>
        <p>Размещая заказ на Сайте, вы делаете нам официальное предложение о покупке выбранных товаров.</p>
        <p>Мы направим вам электронное письмо с подтверждением получения вашего заказа. Это подтверждение не является принятием вашего предложения, а лишь подтверждает, что мы получили ваш заказ.</p>
        <p>Договор купли-продажи считается заключенным с момента направления нам электронного письма с подтверждением отправки вашего заказа.</p>
        <p>Мы принимаем следующие способы оплаты: [ Перевод по реквизитам, оплата через Q-код, по счету ].</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">4. Доставка</h2>
        <p>Способы и сроки доставки уточняйте у менеджера.</p>
        <p>Риск утраты или повреждения товара переходит к вам с момента передачи заказа вам или указанному вами лицу (например, курьерской службе).</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">5. Возврат и гарантия</h2>
        <p>Мы осуществляем возврат товаров в соответствии с законодательством Российской Федерации («Закон о защите прав потребителей»).</p>
        <p>Вы можете вернуть товар надлежащего качества в течение [3 часов] с момента получения, если он не был в употреблении, сохранены его товарный вид и упаковка. </p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">6. Интеллектуальная собственность</h2>
        <p>Все материалы, размещенные на Сайте (тексты, графики, логотипы, изображения, программное обеспечение), являются нашей собственностью или собственностью наших партнеров и защищены законами об интеллектуальной собственности.</p>
        <p>Любое использование материалов Сайте без нашего предварительного письменного согласия запрещено.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">7. Ограничение ответственности</h2>
        <p>BerryShop не несет ответственности за любые косвенные, случайные или прямые убытки, возникшие в результате использования или невозможности использования Сайте.</p>
        <p>Мы не даем никаких гарантий, что работа Сайте будет бесперебойной или безошибочной.</p>
      </div>
      
      <div>
        <h2 className="text-2xl font-bold">8. Изменения условий</h2>
        <p>Мы оставляем за собой право вносить изменения в настоящие Условия использования в любое время. Изменения вступают в силу с момента их публикации на Сайте. Продолжение использования Сайте после внесения изменений означает ваше согласие с ними.</p>
      </div>
      <div>
        <h2 className="text-2xl font-bold">9. Контактная информация</h2>
        <p>По всем вопросам, связанным с Условиями использования, обращайтесь:</p>
        <p>BerryShop</p>
        <p>Электронная почта: Mironovari01@gmail.com</p>
        <p>+7 922 256-52-41</p>
        <p>+7 (982) 585-57-52</p>
      </div>
    </div>
  )
}